app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function fetch()
    {
        $users = $this->userModel->findAll();

INSERT INTO `users` (`name`, `email`) VALUES ('xyz', 'xyz@gmail.com')
---
    public function create()
    {
        $data = [
            'name'  => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
        ];
        $this->userModel->insert($data);

UPDATE `users` SET `name` = 'xyz', `email` = 'xy@gmail.com'
WHERE `users`.`id` IN ('13')
---
    public function update($id)
    {
        $data = [
            'name'  => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
        ];
        $this->userModel->update($id, $data);

DELETE FROM `users`
WHERE `id` IN ('13')
---
    public function delete($id)
    {
        $this->userModel->delete($id);